[
    {
        "name": "Bette Porter",
        "presentIn": [
            {"originalVersion": "Mia Kirshner, Jennifer Beals, Pam Grier, Laurel Holloman, Erin Daniels, Leisha Hailey and Katherine Moennig star in this intimate drama series about a group of lesbian friends struggling with romance and careers in Los Angeles"},
            {"generationQ": "A bold new series for a bold new generation. The groundbreaking drama series, THE L WORD®  returns with THE L WORD®: GENERATION Q, starring Jennifer Beals, Kate Moennig and Leisha Hailey alongside a new group of tightknit friends experiencing life, love, setbacks and success in LA."}
        ],
        "about": "She is a poised, professional and brilliant woman who remains at the top of her game. An openly gay public figure, she's never one to shy away from discussing her sexuality or many other hot button issues. Her romantic entanglements remain complicated, however.",
        "sexualOrientation": "Lesbian",
        "occupation": "Politician, Director of the City of Los Angeles Cultural Affairs Department, Co-Owner and Partner of Wentworth-Porter Art Gallery, Dean of California University's School of Arts, Director at the California Arts Center",
        "portrayedBy": "Jennifer Beals"
    },
    {
        "name": "Shane McCutcheon",
        "presentIn": [
            {"originalVersion": "Mia Kirshner, Jennifer Beals, Pam Grier, Laurel Holloman, Erin Daniels, Leisha Hailey and Katherine Moennig star in this intimate drama series about a group of lesbian friends struggling with romance and careers in Los Angeles"},
            {"generationQ": "A bold new series for a bold new generation. The groundbreaking drama series, THE L WORD®  returns with THE L WORD®: GENERATION Q, starring Jennifer Beals, Kate Moennig and Leisha Hailey alongside a new group of tightknit friends experiencing life, love, setbacks and success in LA."}
        ],
        "about": "She is a hairstylist, formerly a vagrant, crashing on couches and in other people's beds as often as she could, before she became successful in her craft. She left the city, but after ten years, of opening and later selling her lucrative salons, she moved back to LA, wanting to make her mark in a bigger way this time around",
        "sexualOrientation": "Lesbian",
        "occupation": "Owner of Dana's, Owner of several salon chains, Hairdresser, Model",
        "portrayedBy": "Katherine Moennig"
    },
    {
        "name": "Alice Pieszecki",
        "presentIn": [
            {"originalVersion": "Mia Kirshner, Jennifer Beals, Pam Grier, Laurel Holloman, Erin Daniels, Leisha Hailey and Katherine Moennig star in this intimate drama series about a group of lesbian friends struggling with romance and careers in Los Angeles"},
            {"generationQ": "A bold new series for a bold new generation. The groundbreaking drama series, THE L WORD®  returns with THE L WORD®: GENERATION Q, starring Jennifer Beals, Kate Moennig and Leisha Hailey alongside a new group of tightknit friends experiencing life, love, setbacks and success in LA."}
        ],
        "about": "She is usually the comic relief, and is really the one who ties everyone together. She dated Bette for 6 weeks before the series began, and she has close friendships with almost everyone in their group. She loves to gossip and has to know what's going on at all times. She is the creator of 'The Chart', a concept which she turns into a website that keeps track of how all lesbians can be connected through relationships with each other. Alice is typically very outspoken and sometimes gets herself into trouble for not thinking before she speaks. She falls deeply in love with Dana at the end of season 1 and they date for almost all of season 2, but when Dana leaves Alice for Lara, Alice goes off the deep end. She starts popping pills and stalking Dana and keeps a shrine dedicated to her.",
        "sexualOrientation": "Bisexual",
        "occupation": "Host of Her Own TV Show, Journalist, Radio Personailty, Host on The Look",
        "portrayedBy": "Leisha Hailey"
    },
    {
        "name": "Dani Núñez",
        "presentIn": 
            {"generationQ": "A bold new series for a bold new generation. The groundbreaking drama series, THE L WORD®  returns with THE L WORD®: GENERATION Q, starring Jennifer Beals, Kate Moennig and Leisha Hailey alongside a new group of tightknit friends experiencing life, love, setbacks and success in LA."},
        "about": "She is a powerful and calculating PR executive who desperately wants to use that power for good. She's trying (and often failing) to balance her enormous career ambitions and her personal life, but constantly feels like she's not giving enough of herself to either one.",
        "sexualOrientation": "Lesbian",
        "occupation": "PR Executive on Bette Porter's mayoral campaign, Senior Vice President at Nùñez Inc,Director of Communications at Nùñez Inc",
        "portrayedBy": "Arienne Mandi"
    },
    {
        "name": "Sarah Finley",
        "presentIn": 
            {"generationQ": "A bold new series for a bold new generation. The groundbreaking drama series, THE L WORD®  returns with THE L WORD®: GENERATION Q, starring Jennifer Beals, Kate Moennig and Leisha Hailey alongside a new group of tightknit friends experiencing life, love, setbacks and success in LA."},
        "about": "She is an ambivalent careerist who is definitely going to get your coffee order wrong, if she even remembers to get it at all. She's trying to live her best life, though she might not remember large chunks of it, and underneath the fun-loving facade she's struggling with a lot of unresolved issues with her family and deeply religious upbringing.",
        "sexualOrientation": "Lesbian",
        "occupation": "set maintenance on Alice’s TV show",
        "portrayedBy": "Jacqueline Toboni"
    },
    {
        "name": "Tina Kennard",
        "presentIn": [
            {"originalVersion": "Mia Kirshner, Jennifer Beals, Pam Grier, Laurel Holloman, Erin Daniels, Leisha Hailey and Katherine Moennig star in this intimate drama series about a group of lesbian friends struggling with romance and careers in Los Angeles"},
            {"generationQ": "A bold new series for a bold new generation. The groundbreaking drama series, THE L WORD®  returns with THE L WORD®: GENERATION Q, starring Jennifer Beals, Kate Moennig and Leisha Hailey alongside a new group of tightknit friends experiencing life, love, setbacks and success in LA."}
        ],
        "about": "When the show begins Tina has been in a committed relationship with Bette for 7 years. She is portrayed as very sweet and kind, and a good balance to Bette. Tina is a balanced character; she has flaws but overall she is well-rounded and realistic. She is 'taking time off' from work when the show begins so that she can get pregnant. She becomes pregnant in Season 1 by artificial insemination, but miscarries the baby in 1.10. In episode 2.01 it is revealed that Tina is pregnant again but has been hiding it from everyone. She works for a non-profit social justice organization and is very successful - she receives a $100,000 grant from the Peabody Foundation. She dates Helena Peabody for most of season 2, but gets back together with Bette at the end of season 2 and has her daughter, Angelica in the season 2 finale.",
        "sexualOrientation": "Bisexual",
        "occupation": "Chief Development Executive for Peabody-Shaolin Film Studios",
        "portrayedBy": "Laurel Holloman"
    },
    {
        "name": "Helena Peabody",
        "presentIn":
            {"originalVersion": "Mia Kirshner, Jennifer Beals, Pam Grier, Laurel Holloman, Erin Daniels, Leisha Hailey and Katherine Moennig star in this intimate drama series about a group of lesbian friends struggling with romance and careers in Los Angeles"},
        "about": "She is the daughter of multi-millionaire Peggy Peabody and close friend of several main characters in the show. She is played by English actress Rachel Shelley. Helena is an alpha female who almost always publicly or recklessly displays her affection toward accompanying female companions.",
        "sexualOrientation": "Lesbian",
        "occupation": "Director of the Peabody Foundation, Owner of the Hit Club",
        "portrayedBy": "Rachel Shelley"
    },
    {
        "name": "Jenny Schecter",
        "presentIn":
            {"originalVersion": "Mia Kirshner, Jennifer Beals, Pam Grier, Laurel Holloman, Erin Daniels, Leisha Hailey and Katherine Moennig star in this intimate drama series about a group of lesbian friends struggling with romance and careers in Los Angeles"},
        "about": "At first, Jenny is portrayed as the curious, sweet and innocent 'girl next door' figure. However she quickly reveals herself to be selfish and manipulative when she cheats on Tim with Marina. She remains relatively harmless through the rest of season 1, and in season 2 Shane moves in with her. They become extremely close best friends. In season 2 Jenny struggles greatly with what happened to her in the past- she was raped as a child. She starts to develop general anger towards men and becomes a very strong feminist character. At the end of season 2 Shane finds Jenny cutting herself and Jenny goes back to hometown of Illinois to seek help with her self-harm, where she meets Moira, her new 'girlfriend'. Season 3 is the beginning of a turning point for Jenny, where she really starts to go from being 'sweet and innocent' to angry, manipulative, and even cold-hearted at times.",
        "sexualOrientation": "Bisexual",
        "occupation": "Writer, Grocery Clerk, Waitress, Stripper, Movie Director",
        "portrayedBy": "Mia Kirshner"
    }
]

